[
    {
        "id": "project1",
        "title": "A Cyberpunk Themed Website",
        "date": "January 05, 2024",
        "description": "Inspired by the game Cyberpunk 2077 by CD Projekt Red, I designed a fictional website for tourists interested in exploring Night City and its various districts, offering a unique digital experience to plan their visit.",
        "image": "images/Night_City_Default_Page.PNG",
        "link": "https://github.com/MBPeels99/cyberpunk-asp.net-website/tree/master/Night_City"
    },
    {
        "id": "project2",
        "title": "Yahtzee Online Game <br/> Using Laravel",
        "date": "September 07, 2023",
        "description": "In a bid to quickly learn a new framework, Laravel, I developed an online Yahtzee game. Leveraging my skills in PHP and HTML, the project's goal was to enable players to enjoy Yahtzee with friends in a turn-based multiplayer setup.",
        "image": "images/Yahtzee_Laravel_Game.PNG",
        "link": "https://github.com/MBPeels99/laravel_yahtzee_game/tree/master"
    },
    {
        "id": "project3",
        "title": "Metroid-Vania Game<br /> Using JavaScript",
        "date": "October 28, 2023",
        "description": "As an avid gamer, I set out to create a Metroidvania-style game using only HTML and JavaScript, challenging my proficiency in these languages. The project also included learning pixel art creation with Aseprite and practicing version control.",
        "image": "images/HacknSlash.PNG",
        "link": "https://github.com/MBPeels99/javascript_hacknslash/tree/master"
    },
    {
        "id": "project4",
        "title": "Dreamride<br /> Using HTML,Vue.js and PHP",
        "date": "October 28, 2023",
        "description": "My first group project at Educom, Dreamride, was a creative platform for children to write and share stories. I was responsible for developing the database and backend, using Vue.js for dynamic user interactions.",
        "image": "images/Dreamride.PNG",
        "link": "https://github.com/MBPeels99/dreamride/tree/master"
    },
    {
        "id": "project5",
        "title": "Keep Calm and Gym On Website<br /> Using C#</a>",
        "date": "October 24, 2023",
        "description": "A university group project, this website was a practical application of our learning in planning principles. I led the development, utilizing MVC principles to effectively separate the Views from the Controllers and Models.",
        "image": "images/KeepCalmAndGymOn.PNG",
        "link": "https://github.com/MBPeels99/KeepCalmAndGymOn/tree/master"
    },
    {
        "id": "project6",
        "title": "First Person Shooter Wolfenstein Style <br /> Using Python</a>",
        "date": "December 7, 2023",
        "description": "In my exploration of game mechanics, I discovered an instructional YouTube video detailing the creation of a Wolfenstein-style first-person shooter in Python. Inspired by this, I aim to enhance my project by adding additional levels, items, and standard game mechanics, further developing my skills in game development.",
        "image": "images/fps_wolfenstein.PNG",
        "link": "https://github.com/MBPeels99/fps-wolfenstein"
    }
]
