[
    {
        "id": "project1",
        "title": "A Cyberpunk Themed Website <br/> Using C#, CSS and HTML",
        "date": "January 07, 2024",
        "description": "Inspired by the immersive world of CD Projekt Red's 'Cyberpunk 2077', I have embarked on a creative endeavor to design a fictional website, tailored for tourists intrigued by the prospect of exploring the game's vibrant and dynamic setting, Night City. This project aims to offer a unique digital experience for users, allowing them to virtually plan their visit to the various captivating districts within this futuristic metropolis. The genesis of this project was a university assignment, where I was tasked with developing a website. Adhering to the educational framework provided, I focused on utilizing the techniques taught in our curriculum, primarily within the confines of the ASP.NET environment. My dedication to this assignment was reflected in the near-perfect score of 99% that I achieved. However, my journey with this project didn't conclude with the university assignment. Motivated by a desire to expand my skills and push the boundaries of my capabilities, I revisited the initial codebase. This phase was driven by an ambition to enrich the website further, applying the coding principles and best practices that I had absorbed during my challenging yet enriching year at Educom. As it stands, the website is a work in progress. While it has already taken shape, reflecting my vision and technical skills, there is a plethora of features and enhancements I aspire to incorporate. These potential additions are not just technical improvements but also creative expansions that will enhance the overall user experience, making the digital exploration of Night City even more engaging and immersive. This ongoing project is not only a testament to my growth as a developer but also a tribute to the inspiring world of 'Cyberpunk 2077'.",
        "image": "images/Night_City_Default_Page.PNG",
        "link": "https://github.com/MBPeels99/cyberpunk-asp.net-website/tree/master/Night_City"
    },
    {
        "id": "project2",
        "title": "Yahtzee Online Game <br/> Using Laravel",
        "date": "September 07, 2023",
        "description": "In a bid to quickly learn a new framework, Laravel, I developed an online Yahtzee game. Leveraging my skills in PHP and HTML, the project's goal was to enable players to enjoy Yahtzee with friends in a turn-based multiplayer setup.",
        "image": "images/Yahtzee_Laravel_Game.PNG",
        "link": "https://github.com/MBPeels99/laravel_yahtzee_game/tree/master"
    },
    {
        "id": "project3",
        "title": "Metroid-Vania Game<br /> Using JavaScript",
        "date": "October 28, 2023",
        "description": "As an avid gamer, I set out to create a Metroidvania-style game using only HTML and JavaScript, challenging my proficiency in these languages. The project also included learning pixel art creation with Aseprite and practicing version control.",
        "image": "images/HacknSlash.PNG",
        "link": "https://github.com/MBPeels99/javascript_hacknslash/tree/master"
    },
    {
        "id": "project4",
        "title": "Dreamride<br /> Using HTML,Vue.js and PHP",
        "date": "October 28, 2023",
        "description": "My first group project at Educom, Dreamride, was a creative platform for children to write and share stories. I was responsible for developing the database and backend, using Vue.js for dynamic user interactions.",
        "image": "images/Dreamride.PNG",
        "link": "https://github.com/MBPeels99/dreamride/tree/master"
    },
    {
        "id": "project5",
        "title": "Keep Calm and Gym On Website<br /> Using C#</a>",
        "date": "October 24, 2023",
        "description": "A university group project, this website was a practical application of our learning in planning principles. I led the development, utilizing MVC principles to effectively separate the Views from the Controllers and Models.",
        "image": "images/KeepCalmAndGymOn.PNG",
        "link": "https://github.com/MBPeels99/KeepCalmAndGymOn/tree/master"
    },
    {
        "id": "project6",
        "title": "First Person Shooter Wolfenstein Style <br /> Using Python</a>",
        "date": "December 7, 2023",
        "description": "In my exploration of game mechanics, I discovered an instructional YouTube video detailing the creation of a Wolfenstein-style first-person shooter in Python. Inspired by this, I aim to enhance my project by adding additional levels, items, and standard game mechanics, further developing my skills in game development.",
        "image": "images/fps_wolfenstein.PNG",
        "link": "https://github.com/MBPeels99/fps-wolfenstein"
    },
    {
        "id": "project7",
        "title": "Model Playing Super Mario <br /> Using Python</a>",
        "date": "December 6, 2023",
        "description": "Driven by my keen interest in AI and modeling, I embarked on a journey to explore this field further. I engaged with various tutorials to create and train a model to play Super Mario. For convenience and efficiency, I utilized Jupyter Notebook as my primary platform. This endeavor involved leveraging numerous libraries to facilitate the training process. The foundation of my model is the Proximal Policy Optimization (PPO) method, which guided its development and learning strategy.",
        "image": "images/SI_3DSVC_SuperMarioBros.PNG",
        "link": "https://github.com/MBPeels99/ai-super-mario"
    },
    {
        "id": "project8",
        "title": "First Basic Chatbot <br /> Using PHP</a>",
        "date": "October 28, 2023",
        "description": "Motivated by a desire to innovate and deepen my understanding of AI, I embarked on an ambitious project to develop my own chatbot from the ground up. With PHP as my primary programming language, I chose it for this venture. This decision allowed me to experiment and craft an AI that engages in basic communication with users. While the chatbot is still in its nascent stages, it represents a significant step in my journey of learning and creating in the field of artificial intelligence.",
        "image": "images/Image_-_Chatbot.PNG",
        "link": "https://github.com/MBPeels99/php-chatbot"
    },
    {
        "id": "project9",
        "title": "ML Model Analyzing MNIST dataset <br /> Using PHP</a>",
        "date": "January 11, 2024",
        "description": "In this project, I embarked on an educational journey to deepen my understanding of machine learning models by constructing one from the ground up. The foundational aspect of the project utilizes the renowned MNIST dataset, an extensive collection of handwritten digits, as a basis for developing and training the model. This dataset, known for its comprehensive and varied examples of numerical handwriting, provided an ideal starting point for my exploration. The initial phase involved meticulously analyzing these handwritten numbers, an endeavor in which the model demonstrated a notable level of accuracy and efficiency. This success in deciphering static images of handwritten digits served as a solid foundation for the more ambitious aspect of the project. The second phase of the project posed a greater challenge: integrating live input from a camera to recognize and interpret handwritten digits in real-time. Although this component has proven to be more complex and is yet to yield successful results, it represents a significant leap in the application of the model, aiming to bridge the gap between static image recognition and dynamic, real-world interaction. Despite the challenges encountered in this stage, I remain committed to advancing the project. Continuous efforts are being directed towards refining the model's capabilities to effectively process and understand live handwritten digits, a pursuit that not only enhances the model's practical applications but also contributes to my personal growth in the realm of machine learning.",
        "image": "images/mnist-3.0.1.png",
        "link": "https://github.com/MBPeels99/MNIST-dataset-analyze-model"
    },
    {
        "id": "project11",
        "title": "Simple Book Shop Inventory Management <br /> Using C#</a>",
        "date": "May 02, 2023",
        "description": "This project represents a simple Book Shop Inventory Management System, meticulously designed to streamline the management and organization of a bookshop's inventory. At its core, the program is engineered to provide an intuitive and user-friendly interface for performing comprehensive CRUD (Create, Read, Update, Delete) operations on a book database. The system is tailored to cater to the dynamic needs of bookshop operations, enabling users to efficiently manage a vast array of book-related information. Key functionalities include the ability to add new book entries to the inventory (Create), seamlessly browse through the existing catalogue of books (Read), update details of the books (Update), and remove books from the inventory as required (Delete). Each aspect of the program is crafted with precision, ensuring that users can easily navigate through the system and perform the desired operations with minimal effort and maximum efficiency.",
        "image": "images/BookShop.PNG",
        "link": "https://github.com/MBPeels99/book-shop"
    },
    {
        "id": "project12",
        "title": "Simple Arcade Shooting Game <br /> Using C#</a>",
        "date": "April 20, 2023",
        "description": "This application is a dynamic blend of user authentication, database interaction, and arcade-style gaming. It features a secure sign-up and login system with robust validation, ensuring user data integrity. Once logged in, users can access and interact with a database, viewing other users' profiles and high scores, which adds a competitive and social aspect to the experience. The centerpiece of the application is an exciting arcade shooter game where players aim to hit green targets within a one-minute timeframe. This game tests users' reflexes and accuracy, with each player's score being recorded and contributing to their overall ranking. Overall, this application offers an engaging combination of secure user management, social database interaction, and thrilling gameplay, making it an attractive and multifunctional platform for users seeking both entertainment and a sense of community.",
        "image": "images/Arcade_shooter.PNG",
        "link": "https://github.com/MBPeels99/arcade_shooter"
    }
]
